In [266]:
import pandas as pd

In [267]:
titan = pd.read_csv("https://gist.githubusercontent.com/fyyying/4aa5b471860321d7b47fd881898162b7/raw/6907bb3a38bfbb6fccf3a8b1edfb90e39714d14f/titanic_dataset.csv")

In [268]:
titan.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [269]:
titan.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [270]:
titan.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [271]:
titan.drop("Embarked",axis = 1,inplace=True)

In [272]:
titan

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN

In [273]:
d = {
    "Name":["karan","mohan","sohan","raju","vicky"],
    "Age":[20,21,18,19,22],
    "course":["BCA","Btech","BCA","BBA","Btech"]
}

In [274]:
dictdata = pd.DataFrame(d)

In [275]:
dictdata

    Name  Age course
0  karan   20    BCA
1  mohan   21  Btech
2  sohan   18    BCA
3   raju   19    BBA
4  vicky   22  Btech

In [276]:
dictdata["ID"]=[101,102,103,104,105]

In [277]:
dictdata

    Name  Age course   ID
0  karan   20    BCA  101
1  mohan   21  Btech  102
2  sohan   18    BCA  103
3   raju   19    BBA  104
4  vicky   22  Btech  105

In [278]:
dictdata.set_index("ID",inplace=True)

In [279]:
dictdata

      Name  Age course
ID
101  karan   20    BCA
102  mohan   21  Btech
103  sohan   18    BCA
104   raju   19    BBA
105  vicky   22  Btech

In [280]:
titan.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN

In [281]:
df1 = pd.DataFrame(
    {
        'key1':[1,2,3,4,5],
    'key2':[6,7,8,9,10],
    'key3':[11,12,13,14,15]
    },index = [100,200,300,400,500]
)

In [282]:
df1

     key1  key2  key3
100     1     6    11
200     2     7    12
300     3     8    13
400     4     9    14
500     5    10    15

In [283]:
df2 = pd.DataFrame(
    {
        'key1':[21,22,23,4,5],
    'key2':[6,7,81,9,10],
    'key3':[11,2,3,14,15]
    },index = [100,900,600,400,500]
)

In [284]:
df2

     key1  key2  key3
100    21     6    11
900    22     7     2
600    23    81     3
400     4     9    14
500     5    10    15

In [285]:
pd.concat([df1,df2])

     key1  key2  key3
100     1     6    11
200     2     7    12
300     3     8    13
400     4     9    14
500     5    10    15
100    21     6    11
900    22     7     2
600    23    81     3
400     4     9    14
500     5    10    15

In [286]:
pd.concat([df1,df2],axis=True)

     key1  key2  key3  key1  key2  key3
100   1.0   6.0  11.0  21.0   6.0  11.0
200   2.0   7.0  12.0   NaN   NaN   NaN
300   3.0   8.0  13.0   NaN   NaN   NaN
400   4.0   9.0  14.0   4.0   9.0  14.0
500   5.0  10.0  15.0   5.0  10.0  15.0
900   NaN   NaN   NaN  22.0   7.0   2.0
600   NaN   NaN   NaN  23.0  81.0   3.0

In [287]:
df1,df2

(     key1  key2  key3
 100     1     6    11
 200     2     7    12
 300     3     8    13
 400     4     9    14
 500     5    10    15,
      key1  key2  key3
 100    21     6    11
 900    22     7     2
 600    23    81     3
 400     4     9    14
 500     5    10    15)

In [288]:
df1.merge(df2)

   key1  key2  key3
0     4     9    14
1     5    10    15

In [289]:
df1.merge(df2,how='left')

   key1  key2  key3
0     1     6    11
1     2     7    12
2     3     8    13
3     4     9    14
4     5    10    15

In [290]:
data =titan.head()

In [291]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN

In [292]:
data["Fare_INR"]=data["Fare"].apply(lambda x : x*75)

C:\Users\Karan Sharma\AppData\Local\Temp\ipykernel_980\738902828.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data["Fare_INR"]=data["Fare"].apply(lambda x : x*75)

In [293]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Fare_INR
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,543.7500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,5346.2475
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,594.3750
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,3982.5000
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,603.7500

In [294]:
def checkSex(x):
    if x == "male":
        return "sher"
    elif x=="female":
        return "sherni"
    else:
        return "hizda"

In [295]:
data["check_sex"] = data["Sex"].apply(checkSex)

C:\Users\Karan Sharma\AppData\Local\Temp\ipykernel_980\2278539365.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data["check_sex"] = data["Sex"].apply(checkSex)

In [296]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Fare_INR,check_sex
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,543.7500,sher
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,5346.2475,sherni
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,594.3750,sherni
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,3982.5000,sherni
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,603.7500,sher

In [297]:
data['again'] =data["Fare"]*75

C:\Users\Karan Sharma\AppData\Local\Temp\ipykernel_980\3566283608.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['again'] =data["Fare"]*75

In [298]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Fare_INR,check_sex,again
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,543.7500,sher,543.7500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,5346.2475,sherni,5346.2475
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,594.3750,sherni,594.3750
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,3982.5000,sherni,3982.5000
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,603.7500,sher,603.7500

In [299]:
data.drop(['again'],axis = 1,inplace = True)

C:\Users\Karan Sharma\AppData\Local\Temp\ipykernel_980\3268344106.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data.drop(['again'],axis = 1,inplace = True)

In [300]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Fare_INR,check_sex
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,543.7500,sher
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,5346.2475,sherni
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,594.3750,sherni
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,3982.5000,sherni
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,603.7500,sher

In [301]:
Nanvalue = len(data["Cabin"])

In [302]:
data["Cabin"].fillna("karan")

0    karan
1      C85
2    karan
3     C123
4    karan
Name: Cabin, dtype: object

In [303]:
data2 = pd.DataFrame(
        {'math':[50,30,60,80],
         'eng':[45,34,67,23],
         'name':["karan","ankit","abhishek","yash"]
        }
)

In [304]:
data2

   math  eng      name
0    50   45     karan
1    30   34     ankit
2    60   67  abhishek
3    80   23      yash

In [305]:
for i,j in data2.iterrows():
    print(j)

math       50
eng        45
name    karan
Name: 0, dtype: object
math       30
eng        34
name    ankit
Name: 1, dtype: object
math          60
eng           67
name    abhishek
Name: 2, dtype: object
math      80
eng       23
name    yash
Name: 3, dtype: object

In [306]:
data2

   math  eng      name
0    50   45     karan
1    30   34     ankit
2    60   67  abhishek
3    80   23      yash

In [307]:
for i in data2.items():
    print(i)

('math', 0    50
1    30
2    60
3    80
Name: math, dtype: int64)
('eng', 0    45
1    34
2    67
3    23
Name: eng, dtype: int64)
('name', 0       karan
1       ankit
2    abhishek
3        yash
Name: name, dtype: object)

In [308]:
data2["math"]

0    50
1    30
2    60
3    80
Name: math, dtype: int64

In [309]:
data2["math"].sum()

220

In [310]:
data2.apply(lambda x: x.sum(),axis=0)

math                       220
eng                        169
name    karanankitabhishekyash
dtype: object

In [311]:
data2

   math  eng      name
0    50   45     karan
1    30   34     ankit
2    60   67  abhishek
3    80   23      yash

In [312]:
mapcheck = pd.DataFrame({'maths':[2,3,4,5],
                        'eng':[12,13,14,15]
                        })

In [313]:
mapcheck.apply(lambda x : x**2)

   maths  eng
0      4  144
1      9  169
2     16  196
3     25  225

In [314]:
mapcheck.applymap(lambda x:x**2)

   maths  eng
0      4  144
1      9  169
2     16  196
3     25  225

In [315]:
stringdata = pd.DataFrame(
                            {"des":["Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.","this side is karan","working in data analytics"]
                            }
)

In [316]:
stringdata

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              des
0  Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.
1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              this side is karan
2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       working in data analytics

In [317]:
pd.set_option("display.max_colwidth", 1000)

In [318]:
stringdata

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              des
0  Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.
1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              this side is karan
2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       working in data analytics

In [319]:
stringdata['des'].apply(lambda x : len(x))

0    574
1     18
2     25
Name: des, dtype: int64

In [320]:
stringdata["char_count"] = stringdata['des'].apply(lambda x : len(x))

In [321]:
stringdata

,des,char_count
0,"Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.",574
1,this side is karan,18
2,working in data analytics,25

In [322]:
stringdata["word_count"] = stringdata['des'].apply(lambda x : len(x.split()))

In [323]:
stringdata

,des,char_count,word_count
0,"Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.",574,91
1,this side is karan,18,4
2,working in data analytics,25,4

# windows rolling function

In [325]:
rollingfun = pd.DataFrame({"key1":[10,20,30,40,50]})

In [326]:
rollingfun

   key1
0    10
1    20
2    30
3    40
4    50

In [331]:
rollingfun[["key1"]].rolling(window=1).sum()

   key1
0  10.0
1  20.0
2  30.0
3  40.0
4  50.0

In [332]:
rollingfun[["key1"]].rolling(window=2).sum() #sum of previous upper two values in original data

   key1
0   NaN
1  30.0
2  50.0
3  70.0
4  90.0

In [334]:
rollingfun[["key1"]].rolling(window=3).sum()  #sum of previous upper three values in original data

    key1
0    NaN
1    NaN
2   60.0
3   90.0
4  120.0

# Date function

In [336]:
gen_d = pd.date_range(start = "2024 - 02 - 01" ,end = "2024 - 02 - 10")

In [338]:
dateframe = pd.DataFrame(gen_d)

In [340]:
dateframe

           0
0 2024-02-01
1 2024-02-02
2 2024-02-03
3 2024-02-04
4 2024-02-05
5 2024-02-06
6 2024-02-07
7 2024-02-08
8 2024-02-09
9 2024-02-10

In [341]:
type(dateframe)

pandas.core.frame.DataFrame

In [343]:
dateframe.dtypes

0    datetime64[ns]
dtype: object

In [344]:
newdateframe = pd.DataFrame({"date":["2024-02-06","2024-02-07","2024-02-08","2024-02-09","2024-02-10"]})

In [346]:
newdateframe

         date
0  2024-02-06
1  2024-02-07
2  2024-02-08
3  2024-02-09
4  2024-02-10

In [347]:
newdateframe.dtypes

date    object
dtype: object

In [356]:
newdateframe["update_date"] = pd.to_datetime(newdateframe["date"])

In [357]:
newdateframe

         date update_date
0  2024-02-06  2024-02-06
1  2024-02-07  2024-02-07
2  2024-02-08  2024-02-08
3  2024-02-09  2024-02-09
4  2024-02-10  2024-02-10

In [358]:
newdateframe.dtypes

date                   object
update_date    datetime64[ns]
dtype: object

In [354]:
dateframe["day"] = dateframe[0].dt.day
dateframe["month"] = dateframe[0].dt.month
dateframe["year"] = dateframe[0].dt.year

In [355]:
dateframe

           0  day  month  year
0 2024-02-01    1      2  2024
1 2024-02-02    2      2  2024
2 2024-02-03    3      2  2024
3 2024-02-04    4      2  2024
4 2024-02-05    5      2  2024
5 2024-02-06    6      2  2024
6 2024-02-07    7      2  2024
7 2024-02-08    8      2  2024
8 2024-02-09    9      2  2024
9 2024-02-10   10      2  2024